karate-core/src/test/java/com/intuit/karate/core/xml/soap1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:acc="http://foo/bar">
    <soapenv:Header />
    <soapenv:Body>
        <acc:getAccountByPhoneNumber>
            <acc:phoneNumber>#(phoneNumber)</acc:phoneNumber>
            <acc:phoneNumberSearchOption>
                <acc:searchWirelessInd>#(search.wireless)</acc:searchWirelessInd>
                <acc:searchVoipInd>#(search.voip)</acc:searchVoipInd>
                <acc:searchTollFreeInd>#(search.tollFree)</acc:searchTollFreeInd>
            </acc:phoneNumberSearchOption>
        </acc:getAccountByPhoneNumber>
    </soapenv:Body>
</soapenv:Envelope>
